In [2]:
import pandas as pd
import numpy as np

In [4]:
dict1 = { 'date': ['2010-01-30','2010-01-30'],
        'element': ['tmax', 'tmin'],
        'value': [27.8, 14.5]
    }
dict2 ={ 'date': ['2010-02-02','2010-02-02'],
        'element': ['tmax', 'tmin'],
        'value': [27.3, 14.4]
    }

In [7]:
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
print(df1)
print(df2)

         date element  value
0  2010-01-30    tmax   27.8
1  2010-01-30    tmin   14.5
         date element  value
0  2010-02-02    tmax   27.3
1  2010-02-02    tmin   14.4

In [49]:
pd.concat([df1,df2], axis=1)

         date element  value        date element  value
0  2010-01-30    tmax   27.8  2010-02-02    tmax   27.3
1  2010-01-30    tmin   14.5  2010-02-02    tmin   14.4

# pandas concat

In [11]:
concatenated = pd.concat((df1,df2))
concatenated

         date element  value
0  2010-01-30    tmax   27.8
1  2010-01-30    tmin   14.5
0  2010-02-02    tmax   27.3
1  2010-02-02    tmin   14.4

In [12]:
concatenated = pd.concat([df1,df2])
concatenated

         date element  value
0  2010-01-30    tmax   27.8
1  2010-01-30    tmin   14.5
0  2010-02-02    tmax   27.3
1  2010-02-02    tmin   14.4

In [13]:
concatenated.loc[0,:]

         date element  value
0  2010-01-30    tmax   27.8
0  2010-02-02    tmax   27.3

In [14]:
pd.concat([df1,df2], ignore_index=True)

         date element  value
0  2010-01-30    tmax   27.8
1  2010-01-30    tmin   14.5
2  2010-02-02    tmax   27.3
3  2010-02-02    tmin   14.4

In [29]:
#### 2)
uber = pd.read_csv('https://assets.datacamp.com/production/course_2023/datasets/nyc_uber_2014.csv', index_col=0)
uber.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [22]:
uber.shape

(297, 4)

In [38]:
len(uber.Lat)

297

In [41]:
uber1 = uber.iloc[0:99,:]

In [44]:
uber2 = uber.iloc[99:198, :]

In [45]:
len(uber2.Lat)

99

In [46]:
uber3 = uber.iloc[198:,:]

In [47]:
# Concatenate uber1, uber2, and uber3: row_concat
row_concat = pd.concat([uber1,uber2,uber3])

# Print the shape of row_concat
print(row_concat.shape)

# Print the head of row_concat
print(row_concat.head())

(297, 4)
          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

# Combining columns of data

In [50]:
# Concatenate ebola_melt and status_country column-wise: ebola_tidy
ebola_tidy = pd.concat([ebola_melt, status_country], axis=1)

# Print the shape of ebola_tidy
print(ebola_tidy.shape)

# Print the head of ebola_tidy
print(ebola_tidy.head())
ebola_melt.head(3)
status_country.head(3)

NameError: name 'ebola_melt' is not defined

In [51]:
pd.concat([df1,df2], axis=1)

         date element  value        date element  value
0  2010-01-30    tmax   27.8  2010-02-02    tmax   27.3
1  2010-01-30    tmin   14.5  2010-02-02    tmin   14.4

# Finding and concatenating data



###      Concatenating many files : use glob function to find files)))

In [53]:
## Find concatenate

import glob

csv_files = glob.glob('*.csv')

print(csv_files)

['female_literacy_fertility.csv', 'female_literacy_fertility1.csv', 'your_csv_file.csv']

# Another way to create list of DataFrames : using for loop

In [61]:
list=[]
x=[1,2]
for i in x:
    list.append(x)

In [62]:
list

[[1, 2], [1, 2]]

In [ ]:
## Find concatenate

import glob

csv_files = glob.glob('*.csv')

list_data = []


for filename in csv_files:
    data = pd.read_csv(filename, index_col=0)
    list_data.append(data)

pd.concat(list_data)

# Finding files that match a pattern

In [65]:
# Import necessary modules
import pandas as pd
import glob

# Write the pattern: pattern
pattern = '*.csv'

# Save all file matches: csv_files
csv_files = glob.glob(pattern)

# Print the file names
print(csv_files)

# Load the second file into a DataFrame: csv2
csv2 = pd.read_csv(csv_files[1])

# Print the head of csv2
print(csv2.head())

['female_literacy_fertility.csv', 'female_literacy_fertility1.csv', 'your_csv_file.csv']
    Country  Continent  female literacy  fertility  population
0      Chine       ASI             90.5      1.769  1324655000
1       Inde       ASI             50.8      2.682  1139964932
2        USA       NAM             99.0      2.077   304060000
3  Indonésie       ASI             88.8      2.132   227345082
4     Brésil       LAT             90.2      1.827   191971506

# Iterating and concatenating all matches

In [ ]:
# Create an empty list: frames
frames = []

#  Iterate over csv_files
for csv in csv_files:

    #  Read csv into a DataFrame: df
    df = pd.read_csv(csv)
    
    # Append df to frames
    frames.append(df)

# Concatenate frames into a single DataFrame: uber
uber = pd.concat(frames)

# Print the shape of uber
print(uber.shape)

# Print the head of uber
print(uber.head())

# Merge data:


### Similar to joining tables in SQL

### Combine disparate datasets based on common columns

In [67]:
tb1 = { 'state': ['California', 'Texas', 'Florida', 'New York'],
        'population_2016': [39252, 27895,25687,12587],
       }
tb2 = { 'name': ['California', 'Florida',  'New York', 'Texas'],
        'ANSI': ['CA', 'FL', 'NY', 'TX'],
       }

In [69]:
df5 = pd.DataFrame(tb1)
df6 = pd.DataFrame(tb2)

In [72]:
pd.concat([df5,df6],ignore_index=True)

C:\Users\Bota\Miniconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  ANSI        name  population_2016       state
0  NaN         NaN          39252.0  California
1  NaN         NaN          27895.0       Texas
2  NaN         NaN          25687.0     Florida
3  NaN         NaN          12587.0    New York
4   CA  California              NaN         NaN
5   FL     Florida              NaN         NaN
6   NY    New York              NaN         NaN
7   TX       Texas              NaN         NaN

In [73]:
pd.concat([df5,df6],axis=1)

        state  population_2016        name ANSI
0  California            39252  California   CA
1       Texas            27895     Florida   FL
2     Florida            25687    New York   NY
3    New York            12587       Texas   TX

# Joining with merge

In [75]:
pd.merge(left=df5, right = df6, on=None, left_on='state', 
                                                        right_on='name')

        state  population_2016        name ANSI
0  California            39252  California   CA
1       Texas            27895       Texas   TX
2     Florida            25687     Florida   FL
3    New York            12587    New York   NY

# This is One -to-one merge

# Many-to-1 data merge

In [ ]:
# Merge the DataFrames: m2o
m2o = pd.merge(left = site, right=visited, left_on='name', right_on= 'site')

# Print m2o
print(m2o)
visited.head(2)
site.head(2)

# Many-to-many data merge

In [ ]:
# Merge site and visited: m2m
m2m = pd.merge(left=site, right=visited, left_on='name', right_on='site')

# Merge m2m and survey: m2m
m2m = pd.merge(left=m2m, right=survey, left_on='ident', right_on='taken')

# Print the first 20 lines of m2m
print(m2m.head(20))